===
PTC0033: Simple function with trivial body
===

module

let identity x =
  x

---

(source_file
  (module_declaration
    (module_signature
      (module))
    (function_declaration
      (let)
      name: (identifier)
      (function_parameter
        name: (identifier))
      (eq)
      (implicit_block_open)
      single_return: (value_expression
        (identifier))
      (implicit_block_close))))

===
PTC0034: Simple function with multiple parameters
===

module

let fst x y z =
  x

---

(source_file
  (module_declaration
    (module_signature
      (module))
    (function_declaration
      (let)
      name: (identifier)
      (function_parameter
        name: (identifier))
      (function_parameter
        name: (identifier))
      (function_parameter
        name: (identifier))
      (eq)
      (implicit_block_open)
      single_return: (value_expression
        (identifier))
      (implicit_block_close))))

===
PTC0035: Function with record pattern parameter
===

module

let pickX { x, y, z } =
  x

---

(source_file
  (module_declaration
    (module_signature
      (module))
    (function_declaration
      (let)
      name: (identifier)
      (function_parameter
        (record_pattern
          (simple_record_key)
          (simple_record_key)
          (simple_record_key)))
      (eq)
      (implicit_block_open)
      single_return: (value_expression
        (identifier))
      (implicit_block_close))))

===
PTC0036: Function with sequence pattern parameter
===

module

let pickY [_, looooooooooooong, ...rest] =
  looooooooooooong

---

(source_file
  (module_declaration
    (module_signature
      (module))
    (function_declaration
      (let)
      name: (identifier)
      (function_parameter
        (sequence_pattern
          (dont_care)
          (identifier)
          (rest_args
            (dotdotdot)
            (rest_args_identifier))))
      (eq)
      (implicit_block_open)
      single_return: (value_expression
        (identifier))
      (implicit_block_close))))

===
PTC0037: Function with custom type pattern parameter
===

module

let extract (Id id) =
  id

---

(source_file
  (module_declaration
    (module_signature
      (module))
    (function_declaration
      (let)
      (identifier)
      (function_parameter
        (custom_type_pattern
          (custom_type_constructor_name)
          (identifier)))
      (eq)
      (implicit_block_open)
      (value_expression
        (identifier))
      (implicit_block_close))))

===
PTC0038: Simple anonymous function via top-level let binding
===

module

let giveMeTheAnswer = { 42 }

---

(source_file
  (module_declaration
    (module_signature
      (module))
    (let_declaration
      (let)
      (identifier)
      (eq)
      (implicit_block_open)
      (anonymous_function_expression
        (value_expression
          (int_literal)))
      (implicit_block_close))))

===
PTC0039: Simple anonymous function bound via function declaration
===

module

let giveMeTheAnswer =
  { 42 }

---

(source_file
  (module_declaration
    (module_signature
      (module))
    (let_declaration
      (let)
      (identifier)
      (eq)
      (implicit_block_open)
      (anonymous_function_expression
        (value_expression
          (int_literal)))
      (implicit_block_close))))

===
PTC0040: Anonymous function with params via top-level let binding
===

module

let giveMeTheAnswer =
  { x -> x }

---

(source_file
  (module_declaration
    (module_signature
      (module))
    (let_declaration
      (let)
      (identifier)
      (eq)
      (implicit_block_open)
      (anonymous_function_expression
        (function_parameter
          (identifier))
        (arrow)
        (value_expression
          (identifier)))
      (implicit_block_close))))

===
PTC0041: Anonymous function with pattern params via top-level let binding
===

module

let pickX =
  { { x, y, z } -> x }

---

(source_file
  (module_declaration
    (module_signature
      (module))
    (let_declaration
      (let)
      (identifier)
      (eq)
      (implicit_block_open)
      (anonymous_function_expression
        (function_parameter
          (record_pattern
            (simple_record_key)
            (simple_record_key)
            (simple_record_key)))
        (arrow)
        (value_expression
          (identifier)))
      (implicit_block_close))))

===
PTC0042: Anonymous function with pattern and normal params via top-level let binding
===

module

let pickY =
  { x { y } [ _, z, ...rest ] (Id id) -> id }

---

(source_file
  (module_declaration
    (module_signature
      (module))
    (let_declaration
      (let)
      (identifier)
      (eq)
      (implicit_block_open)
      (anonymous_function_expression
        (function_parameter
          (identifier))
        (function_parameter
          (record_pattern
            (simple_record_key)))
        (function_parameter
          (sequence_pattern
            (dont_care)
            (identifier)
            (rest_args
              (dotdotdot)
              (rest_args_identifier))))
        (function_parameter
          (custom_type_pattern
            (custom_type_constructor_name)
            (identifier)))
        (arrow)
        (value_expression
          (identifier)))
      (implicit_block_close))))

===
PTC0043: Anonymous function with params and itermittent let bindings via top-level let binding
===

module

let giveMeTheAnswer =
  { x ->
    let y = 1
    let z = 2
    42
  }

---

(source_file
  (module_declaration
    (module_signature
      (module))
    (let_declaration
      (let)
      (identifier)
      (eq)
      (implicit_block_open)
      (anonymous_function_expression
        (function_parameter
          (identifier))
        (arrow)
        (let_expression
          (let)
          (identifier)
          (eq)
          (implicit_block_open)
          (value_expression
            (int_literal))
          (implicit_block_close))
        (let_expression
          (let)
          (identifier)
          (eq)
          (implicit_block_open)
          (value_expression
            (int_literal))
          (implicit_block_close))
        (value_expression
          (int_literal)))
      (implicit_block_close))))

===
PTC0044: Compact anonymous function with when expression body via top-level let binding
===

module

let result =
  { when it is
    | 42 -> "The Answer"
    | else -> "No idea"
  }

---

(source_file
  (module_declaration
    (module_signature
      (module))
    (let_declaration
      (let)
      (identifier)
      (eq)
      (implicit_block_open)
      (anonymous_function_expression
        (when_expression
          (when)
          (value_expression
            (identifier))
          (is)
          (when_branch
            (when_branch_pattern
              (int_literal))
            (arrow)
            (when_branch_consequence
              (implicit_block_open)
              (value_expression
                (string_literal))
              (implicit_block_close)))
          (when_branch_catchall
            (else)
            (arrow)
            (when_branch_consequence
              (implicit_block_open)
              (value_expression
                (string_literal))
              (implicit_block_close)))))
      (implicit_block_close))))

===
PTC0045: Piping int value into function via builtin (|>) forward pipe operator
===

module

let result =
  41 |> add 1

---

(source_file
  (module_declaration
    (module_signature
      (module))
    (let_declaration
      (let)
      (identifier)
      (eq)
      (implicit_block_open)
      (binary_pipe_expression
        (value_expression
          (int_literal))
        (pipe_operator)
        (call_expression
          (identifier)
          (call_parameter
            (value_expression
              (int_literal)))))
      (implicit_block_close))))

===
PTC0046: Mapping over sequence multiple times via builtin (|>) forward pipe operator
===

module

let result =
  [ 40, 41, 42 ]
    |> map addOne
    |> map math.times2

---

(source_file
  (module_declaration
    (module_signature
      (module))
    (let_declaration
      (let)
      (identifier)
      (eq)
      (implicit_block_open)
      (binary_pipe_expression
        (binary_pipe_expression
          (sequence_expression
            (sequence_expression_entry
              (value_expression
                (int_literal)))
            (sequence_expression_entry
              (value_expression
                (int_literal)))
            (sequence_expression_entry
              (value_expression
                (int_literal))))
          (pipe_operator)
          (call_expression
            (identifier)
            (call_parameter
              (value_expression
                (identifier)))))
        (pipe_operator)
        (call_expression
          (identifier)
          (call_parameter
            (qualified_function_ref_expression
              (identifier)
              (dot)
              (identifier)))))
      (implicit_block_close))))

===
PTC0047: (regression) Mapping over sequence with explicit parens via (|>) should yield the same associativity grouping as leaving the parens out.
===

module

let result =
  (([ 40, 41, 42 ] |> map addOne)
    |> map math.times2
  )

---

(source_file
  (module_declaration
    (module_signature
      (module))
    (let_declaration
      (let)
      (identifier)
      (eq)
      (implicit_block_open)
      (binary_pipe_expression
        (binary_pipe_expression
          (sequence_expression
            (sequence_expression_entry
              (value_expression
                (int_literal)))
            (sequence_expression_entry
              (value_expression
                (int_literal)))
            (sequence_expression_entry
              (value_expression
                (int_literal))))
          (pipe_operator)
          (call_expression
            (identifier)
            (call_parameter
              (value_expression
                (identifier)))))
        (pipe_operator)
        (call_expression
          (identifier)
          (call_parameter
            (qualified_function_ref_expression
              (identifier)
              (dot)
              (identifier)))))
      (implicit_block_close))))
